// 一次性引入全部地图配置文件
// document.write('<script src="maps/test01.js" charset="utf-8"></script>');
// document.write('<script src="maps/test02.js" charset="utf-8"></script>');


/*
 * 测试地图20*20系列
 */

// 1号
var map_20_20_01 = {
    dimension: [20, 20],
    agents: [
        {
            'start': [0, 0],
            'goal': [7, 2],
            'name': 'agent1',
            'color': [255, 0, 0]
        }, {
            'start': [2, 0],
            'goal': [0, 9],
            'name': 'agent2',
            'color': [0, 255, 0]
        }
    ],
    wallRatio: 0.1,
};

// 2号
var map_20_20_02 = {
    dimension: [20, 20],
    agents: [
        {
            'start': [0, 0],
            'goal': [15, 2],
            'name': 'agent1',
            'color': [255, 0, 0]
        }, {
            'start': [7, 0],
            'goal': [0, 14],
            'name': 'agent2',
            'color': [0, 255, 0]
        }
    ],
    wallRatio: 0.1,
};


/*==================================================================*/

/*
 * 测试地图30*30系列
 */

// 1号
var map_30_30_01 = {
    dimension: [30, 30],
    agents: [
        {
            'start': [0, 20],
            'goal': [7, 25],
            'name': 'agent1',
            'color': [255, 0, 0]
        }, {
            'start': [20, 0],
            'goal': [10, 9],
            'name': 'agent2',
            'color': [0, 255, 0]
        }
    ],
    wallRatio: 0.1,
};

var map_test = {"dimension":["20","20"],"agents":[{"start":[0,0],"goal":[7,2],"name":"agent1","color":[255,0,0]},{"start":[2,0],"goal":[0,9],"name":"agent2","color":[0,255,0]}],"obstacles":[[1,10],[1,14],[2,12],[2,19],[3,0],[3,1],[3,3],[3,5],[3,7],[3,11],[4,5],[5,9],[5,11],[6,2],[6,18],[8,3],[8,4],[8,16],[9,1],[9,3],[10,4],[10,19],[11,18],[13,6],[13,14],[13,16],[14,8],[15,2],[15,8],[15,12],[15,19],[16,3],[16,4],[17,19],[18,2],[18,3],[19,1],[19,10]],"wallRatio":-1};

var map_test2 = {"dimension":["20","20"],"agents":[{"start":[0,0],"goal":[7,2],"name":"agent1","color":[255,0,0]},{"start":[2,0],"goal":[0,9],"name":"agent2","color":[0,255,0]}],"obstacles":[[1,10],[1,14],[2,12],[2,19],[3,0],[3,1],[3,3],[3,5],[3,7],[3,11],[4,5],[5,9],[5,11],[6,2],[6,18],[8,3],[8,4],[8,16],[9,1],[9,3],[10,4],[10,19],[11,18],[13,6],[13,14],[13,16],[14,8],[15,2],[15,8],[15,12],[15,19],[16,3],[16,4],[17,19],[18,2],[18,3],[19,1],[19,10],[1,1],[1,2],[1,3],[0,3],[2,4],[3,4],[1,4]],"wallRatio":-1};


/*=============================================================================*/
/*
    从yaml批量生成的地图数据
*/

map_8by8_12_1_ex0 = {"dimension": [8, 8], "agents": [{"goal": [7, 6], "name": "agent0", "start": [2, 6], "color": [231, 76, 60]}], "obstacles": [[5, 3], [4, 3], [7, 1], [4, 4], [3, 7], [5, 4], [4, 6], [7, 3], [1, 2], [1, 7], [2, 1], [3, 2]], "wallRatio": -1}
map_8by8_12_1_ex1 = {"dimension": [8, 8], "agents": [{"goal": [6, 1], "name": "agent0", "start": [2, 0], "color": [231, 76, 60]}], "obstacles": [[4, 3], [2, 1], [5, 5], [5, 6], [1, 3], [2, 2], [5, 3], [1, 0], [7, 6], [7, 3], [6, 2], [4, 7]], "wallRatio": -1}
map_8by8_12_1_ex10 = {"dimension": [8, 8], "agents": [{"goal": [2, 0], "name": "agent0", "start": [4, 6], "color": [231, 76, 60]}], "obstacles": [[2, 5], [3, 5], [0, 5], [0, 1], [1, 3], [6, 7], [3, 3], [2, 6], [5, 5], [4, 2], [7, 0], [2, 3]], "wallRatio": -1}
map_8by8_12_1_ex2 = {"dimension": [8, 8], "agents": [{"goal": [5, 4], "name": "agent0", "start": [0, 7], "color": [231, 76, 60]}], "obstacles": [[3, 3], [3, 7], [5, 7], [7, 2], [7, 3], [3, 1], [3, 0], [6, 3], [0, 6], [2, 2], [4, 0], [6, 6]], "wallRatio": -1}
map_8by8_12_1_ex3 = {"dimension": [8, 8], "agents": [{"goal": [7, 5], "name": "agent0", "start": [0, 0], "color": [231, 76, 60]}], "obstacles": [[0, 5], [0, 1], [0, 6], [3, 1], [7, 2], [5, 7], [5, 5], [6, 3], [0, 3], [3, 6], [3, 4], [1, 1]], "wallRatio": -1}
map_8by8_12_1_ex4 = {"dimension": [8, 8], "agents": [{"goal": [5, 3], "name": "agent0", "start": [3, 5], "color": [231, 76, 60]}], "obstacles": [[2, 6], [5, 6], [2, 1], [0, 0], [4, 0], [4, 4], [7, 4], [6, 1], [0, 5], [6, 5], [5, 1], [2, 2]], "wallRatio": -1}
map_8by8_12_1_ex5 = {"dimension": [8, 8], "agents": [{"goal": [4, 3], "name": "agent0", "start": [7, 0], "color": [231, 76, 60]}], "obstacles": [[4, 1], [7, 6], [3, 3], [2, 2], [1, 3], [7, 3], [2, 0], [5, 6], [1, 2], [4, 7], [4, 4], [1, 5]], "wallRatio": -1}
map_8by8_12_1_ex6 = {"dimension": [8, 8], "agents": [{"goal": [7, 1], "name": "agent0", "start": [2, 5], "color": [231, 76, 60]}], "obstacles": [[1, 4], [0, 1], [7, 0], [4, 0], [4, 7], [5, 0], [7, 2], [7, 4], [7, 7], [2, 0], [4, 2], [3, 0]], "wallRatio": -1}
map_8by8_12_1_ex7 = {"dimension": [8, 8], "agents": [{"goal": [5, 6], "name": "agent0", "start": [2, 0], "color": [231, 76, 60]}], "obstacles": [[6, 4], [7, 3], [4, 0], [1, 5], [3, 1], [3, 0], [0, 3], [2, 2], [3, 2], [3, 3], [6, 5], [4, 4]], "wallRatio": -1}
map_8by8_12_1_ex8 = {"dimension": [8, 8], "agents": [{"goal": [2, 4], "name": "agent0", "start": [6, 3], "color": [231, 76, 60]}], "obstacles": [[0, 7], [0, 0], [5, 7], [5, 4], [1, 1], [2, 7], [1, 7], [6, 0], [3, 0], [7, 2], [7, 5], [5, 3]], "wallRatio": -1}
map_8by8_12_1_ex9 = {"dimension": [8, 8], "agents": [{"goal": [0, 6], "name": "agent0", "start": [6, 4], "color": [231, 76, 60]}], "obstacles": [[2, 0], [4, 2], [3, 3], [1, 3], [7, 4], [3, 5], [5, 5], [5, 4], [1, 7], [2, 1], [6, 1], [5, 0]], "wallRatio": -1}

map_8by8_12_6_ex0 = {"dimension": [8, 8], "agents": [{"goal": [0, 4], "name": "agent0", "start": [4, 1], "color": [231, 76, 60]}, {"goal": [6, 2], "name": "agent1", "start": [6, 4], "color": [46, 204, 113]}, {"goal": [4, 0], "name": "agent2", "start": [1, 2], "color": [241, 196, 15]}, {"goal": [2, 1], "name": "agent3", "start": [0, 4], "color": [52, 152, 219]}, {"goal": [3, 5], "name": "agent4", "start": [1, 6], "color": [155, 89, 182]}, {"goal": [0, 0], "name": "agent5", "start": [4, 4], "color": [211, 84, 0]}], "obstacles": [[4, 6], [0, 7], [6, 5], [5, 7], [0, 5], [2, 4], [0, 6], [4, 2], [1, 5], [4, 5], [5, 2], [3, 4]], "wallRatio": -1}
map_8by8_12_6_ex1 = {"dimension": [8, 8], "agents": [{"goal": [2, 2], "name": "agent0", "start": [7, 6], "color": [231, 76, 60]}, {"goal": [0, 5], "name": "agent1", "start": [4, 3], "color": [46, 204, 113]}, {"goal": [7, 5], "name": "agent2", "start": [1, 5], "color": [241, 196, 15]}, {"goal": [1, 0], "name": "agent3", "start": [6, 7], "color": [52, 152, 219]}, {"goal": [7, 6], "name": "agent4", "start": [3, 2], "color": [155, 89, 182]}, {"goal": [7, 3], "name": "agent5", "start": [5, 7], "color": [211, 84, 0]}], "obstacles": [[2, 0], [3, 3], [3, 0], [1, 7], [1, 3], [6, 5], [2, 1], [3, 6], [7, 7], [0, 6], [1, 6], [0, 0]], "wallRatio": -1}
map_8by8_12_6_ex2 = {"dimension": [8, 8], "agents": [{"goal": [6, 3], "name": "agent0", "start": [4, 0], "color": [231, 76, 60]}, {"goal": [7, 1], "name": "agent1", "start": [6, 4], "color": [46, 204, 113]}, {"goal": [5, 1], "name": "agent2", "start": [1, 4], "color": [241, 196, 15]}, {"goal": [6, 5], "name": "agent3", "start": [7, 4], "color": [52, 152, 219]}, {"goal": [1, 1], "name": "agent4", "start": [3, 2], "color": [155, 89, 182]}, {"goal": [4, 6], "name": "agent5", "start": [1, 6], "color": [211, 84, 0]}], "obstacles": [[6, 7], [2, 5], [6, 0], [2, 3], [3, 4], [0, 5], [2, 1], [0, 3], [0, 4], [2, 2], [5, 0], [6, 1]], "wallRatio": -1}
map_8by8_12_6_ex3 = {"dimension": [8, 8], "agents": [{"goal": [3, 7], "name": "agent0", "start": [4, 0], "color": [231, 76, 60]}, {"goal": [1, 6], "name": "agent1", "start": [2, 1], "color": [46, 204, 113]}, {"goal": [5, 0], "name": "agent2", "start": [5, 7], "color": [241, 196, 15]}, {"goal": [6, 7], "name": "agent3", "start": [5, 5], "color": [52, 152, 219]}, {"goal": [0, 3], "name": "agent4", "start": [6, 5], "color": [155, 89, 182]}, {"goal": [5, 7], "name": "agent5", "start": [0, 7], "color": [211, 84, 0]}], "obstacles": [[7, 3], [7, 4], [6, 6], [2, 6], [5, 3], [7, 1], [0, 0], [2, 4], [3, 3], [7, 2], [3, 2], [4, 3]], "wallRatio": -1}
map_8by8_12_6_ex4 = {"dimension": [8, 8], "agents": [{"goal": [3, 6], "name": "agent0", "start": [0, 0], "color": [231, 76, 60]}, {"goal": [4, 5], "name": "agent1", "start": [7, 6], "color": [46, 204, 113]}, {"goal": [0, 7], "name": "agent2", "start": [2, 7], "color": [241, 196, 15]}, {"goal": [1, 6], "name": "agent3", "start": [4, 6], "color": [52, 152, 219]}, {"goal": [0, 4], "name": "agent4", "start": [2, 0], "color": [155, 89, 182]}, {"goal": [7, 0], "name": "agent5", "start": [1, 5], "color": [211, 84, 0]}], "obstacles": [[0, 1], [0, 3], [7, 3], [6, 4], [3, 5], [5, 2], [5, 0], [7, 2], [7, 7], [4, 4], [6, 3], [4, 7]], "wallRatio": -1}
